Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
"
            "LangfuseSync"  = "disabled"
            "Lifecycle"     = "production"
            "LogType"       = "application"
            "ManagedBy"     = "terraform"
            "Name"          = "/aws/ecs/crawlinghub-web-api-prod/application"
            "Owner"         = "platform@ryuqqq.com"
          ~ "Project"       = "infrastructure" -> "crawlinghub"
            "RetentionDays" = "30"
            "SentrySync"    = "disabled"
            "Service"       = "crawlinghub-web-api"
        }
      ~ tags_all          = {
          ~ "Project"       = "infrastructure" -> "crawlinghub"
            # (15 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

Plan: 19 to add, 3 to change, 13 to destroy.

Changes to Outputs:
~ alb_arn      = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c" -> (known after apply)
~ alb_dns_name = "crawlinghub-alb-prod-1970691289.ap-northeast-2.elb.amazonaws.com" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-web-api-prod
  ```
Plan: 19 to add, 3 to change, 13 to destroy.

---
### 2. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.scheduler will be updated in-place
~ resource "aws_ecs_service" "scheduler" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-scheduler-prod"
        name                               = "crawlinghub-scheduler-prod"
        tags                               = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-scheduler-prod"
        }
        # (17 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0a10c8d16f5b525a2",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.scheduler must be replaced
-/+ resource "aws_ecs_task_definition" "scheduler" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value)
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::646886795421:role/crawlinghub-scheduler-execution-role-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "crawlinghub-scheduler-prod" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-scheduler-prod"
        }
      ~ task_role_arn            = "arn:aws:iam::646886795421:role/crawlinghub-scheduler-task-role-prod" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.scheduler_task will be destroyed
  # (because aws_iam_role.scheduler_task is not in configuration)
- resource "aws_iam_role" "scheduler_task" {
      - arn                   = "arn:aws:iam::646886795421:role/crawlinghub-scheduler-task-role-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-11-20T14:34:44Z" -> null
      - force_detach_policies = false -> null
      - id                    = "crawlinghub-scheduler-task-role-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonPrometheusRemoteWriteAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "crawlinghub-scheduler-task-role-prod" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
      - unique_id             = "AROAZNHLVFCO4NSHJS6ZR" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "crawlinghub-scheduler-adot-amp-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "aps:RemoteWrite",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                          - Sid      = "AMPRemoteWrite"
                        },
                      - {
                          - Action   = [
                              - "s3:GetObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::connectly-prod/*"
                          - Sid      = "S3ConfigAccess"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "crawlinghub-scheduler-eventbridge-access-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "events:PutEvents",
                              - "events:PutRule",
                              - "events:PutTargets",
                              - "events:DeleteRule",
                              - "events:RemoveTargets",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "otel-config-s3-access" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:GetObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::connectly-prod/otel-config/*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.scheduler_task_execution will be destroyed
  # (because aws_iam_role.scheduler_task_execution is not in configuration)
- resource "aws_iam_role" "scheduler_task_execution" {
      - arn                   = "arn:aws:iam::646886795421:role/crawlinghub-scheduler-execution-role-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-11-20T14:34:44Z" -> null
      - force_detach_policies = false -> null
      - id                    = "crawlinghub-scheduler-execution-role-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "crawlinghub-scheduler-execution-role-prod" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
      - unique_id             = "AROAZNHLVFCO5BYSKHHB6" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "crawlinghub-scheduler-secrets-access-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                            ]
                        },
                      - {
                          - Action   = [
                              - "ssm:GetParameters",
                              - "ssm:GetParameter",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.scheduler_adot_amp_access will be destroyed
  # (because aws_iam_role_policy.scheduler_adot_amp_access is not in configuration)
- resource "aws_iam_role_policy" "scheduler_adot_amp_access" {
      - id          = "crawlinghub-scheduler-task-role-prod:crawlinghub-scheduler-adot-amp-prod" -> null
      - name        = "crawlinghub-scheduler-adot-amp-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "aps:RemoteWrite",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      - Sid      = "AMPRemoteWrite"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::connectly-prod/*"
                      - Sid      = "S3ConfigAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-scheduler-task-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.scheduler_eventbridge_access will be destroyed
  # (because aws_iam_role_policy.scheduler_eventbridge_access is not in configuration)
- resource "aws_iam_role_policy" "scheduler_eventbridge_access" {
      - id          = "crawlinghub-scheduler-task-role-prod:crawlinghub-scheduler-eventbridge-access-prod" -> null
      - name        = "crawlinghub-scheduler-eventbridge-access-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "events:PutEvents",
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:DeleteRule",
                          - "events:RemoveTargets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-scheduler-task-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.scheduler_secrets_access will be destroyed
  # (because aws_iam_role_policy.scheduler_secrets_access is not in configuration)
- resource "aws_iam_role_policy" "scheduler_secrets_access" {
      - id          = "crawlinghub-scheduler-execution-role-prod:crawlinghub-scheduler-secrets-access-prod" -> null
      - name        = "crawlinghub-scheduler-secrets-access-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-scheduler-execution-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.scheduler_task_execution will be destroyed
  # (because aws_iam_role_policy_attachment.scheduler_task_execution is not in configuration)
- resource "aws_iam_role_policy_attachment" "scheduler_task_execution" {
      - id         = "crawlinghub-scheduler-execution-role-prod-20251120143445715400000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "crawlinghub-scheduler-execution-role-prod" -> null
    }

  # aws_security_group.ecs_scheduler will be destroyed
  # (because aws_security_group.ecs_scheduler is not in configuration)
- resource "aws_security_group" "ecs_scheduler" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-0a10c8d16f5b525a2" -> null
      - description            = "Security group for scheduler ECS tasks" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all outbound traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a10c8d16f5b525a2" -> null
      - ingress                = [] -> null
      - name                   = "crawlinghub-scheduler-sg-prod" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "crawlinghub-scheduler-sg-prod"
        } -> null
      - tags_all               = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Name"        = "crawlinghub-scheduler-sg-prod"
          - "Project"     = "crawlinghub"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs_security_group.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for scheduler ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "crawlinghub-scheduler-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
          + "Type"        = "custom"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for scheduler ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
          + "Type"        = "custom"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
    }

  # module.scheduler_logs.aws_cloudwatch_log_group.this will be updated in-place
~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/ecs/crawlinghub-scheduler-prod/application"
        name              = "/aws/ecs/crawlinghub-scheduler-prod/application"
      ~ tags              = {
            "Component"     = "log-group"
            "CostCenter"    = "engineering"
            "DataClass"     = "confidential"
            "Environment"   = "prod"
            "ExportToS3"    = "disabled"
            "KMSEncrypted"  = "false"
            "LangfuseSync"  = "disabled"
            "Lifecycle"     = "production"
            "LogType"       = "application"
            "ManagedBy"     = "terraform"
            "Name"          = "/aws/ecs/crawlinghub-scheduler-prod/application"
            "Owner"         = "platform@ryuqqq.com"
          ~ "Project"       = "infrastructure" -> "crawlinghub"
            "RetentionDays" = "30"
            "SentrySync"    = "disabled"
            "Service"       = "crawlinghub-scheduler"
        }
      ~ tags_all          = {
          ~ "Project"       = "infrastructure" -> "crawlinghub"
            # (15 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.scheduler_task_execution_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for crawlinghub-scheduler-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-scheduler-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
      + unique_id             = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-scheduler-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy.secrets-manager[0] will be created
+ resource "aws_iam_role_policy" "secrets-manager" {
      + id          = (known after apply)
      + name        = "crawlinghub-scheduler-execution-role-prod-secrets-manager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.scheduler_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "crawlinghub-scheduler-execution-role-prod"
    }

  # module.scheduler_task_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for crawlinghub-scheduler-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-scheduler-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-scheduler-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-scheduler"
        }
      + unique_id             = (known after apply)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-scheduler-task-role-prod-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::connectly-prod/*"
                      + Sid      = "S3ConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.scheduler_task_role.aws_iam_role_policy.custom["eventbridge-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-scheduler-task-role-prod-eventbridge-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:PutEvents",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DeleteRule",
                          + "events:RemoveTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 10 to add, 2 to change, 8 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-scheduler-prod:14" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-scheduler-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-scheduler%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-scheduler-prod
  ```
Plan: 10 to add, 2 to change, 8 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```